Revit 2023 API
PointCloudType.EngineIdentifier Property
 The identifier of the engine responsible for handling of the point cloud.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2012
Syntax
C#
public string EngineIdentifier { get; }
Visual Basic
Public ReadOnly Property EngineIdentifier As String
	Get
Visual C++
public:
property String^ EngineIdentifier {
	String^ get ();
}
Remarks
 The built-in engine provides "pcg" here.
See Also
PointCloudType Class
Autodesk.Revit.DB Namespace